#+Title: JOM299
#+Author: Basile Simon
#+Email: @basilesimon

#+OPTIONS: toc:nil num:nil
#+OPTIONS: reveal_width:1200
#+OPTIONS: reveal_height:800
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+OPTIONS: reveal_center:nil 
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t 
#+OPTIONS: org-html-indent:nil
#+REVEAL_TRANS: linear
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Title">
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_EXTRA_CSS: ../presentation/mozilla-devrel-light.css
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_HLEVEL: 2


* moodle
  :LOGBOOK:
  CLOCK: [2018-01-18 Thu 11:32]--[2018-01-18 Thu 11:55] =>  0:23
  :END:
* 1.1: The basics
  :LOGBOOK:
  CLOCK: [2018-01-23 Tue 22:45]--[2018-01-23 Tue 23:04] =>  0:19
  CLOCK: [2018-01-23 Tue 17:51]--[2018-01-23 Tue 18:29] =>  0:38
  CLOCK: [2018-01-18 Thu 20:31]--[2018-01-18 Thu 20:56] =>  0:25
  CLOCK: [2017-12-27 Wed 16:00]--[2017-12-27 Wed 16:39] =>  0:39
  :END:
* 1.2: More exercises
  :LOGBOOK:
  CLOCK: [2018-01-25 Thu 20:21]--[2018-01-25 Thu 23:51] =>  3:30
  CLOCK: [2018-01-18 Thu 21:24]--[2018-01-18 Thu 21:32] =>  0:08
  CLOCK: [2018-01-15 Mon 20:54]--[2018-01-15 Mon 21:29] =>  0:35
  CLOCK: [2018-01-15 Mon 20:30]--[2018-01-15 Mon 20:54] =>  0:24
  CLOCK: [2017-12-27 Wed 16:39]--[2017-12-27 Wed 16:54] =>  0:15
  :END:
* 2.1: File formats, writing code
  :LOGBOOK:
  CLOCK: [2018-01-29 Mon 22:52]--[2018-01-30 Tue 00:25] =>  1:33
  CLOCK: [2018-01-29 Mon 18:45]--[2018-01-29 Mon 19:30] =>  0:45
  CLOCK: [2018-01-27 Sat 16:42]--[2018-01-27 Sat 19:42] =>  3:00
  CLOCK: [2018-01-18 Thu 12:07]--[2018-01-18 Thu 13:33] =>  1:26
  :END:

* 2.2: An intro to Python
  :LOGBOOK:
  CLOCK: [2018-02-01 Thu 23:59]--[2018-02-02 Fri 01:10] =>  1:11
  CLOCK: [2018-01-30 Tue 19:12]--[2018-01-30 Tue 23:12] =>  4:00
  CLOCK: [2018-01-18 Thu 22:12]--[2018-01-18 Thu 23:12] =>  1:00
  :END:
* 3.1: Simple scraping in Python
  :LOGBOOK:
  CLOCK: [2018-02-05 Mon 22:59]--[2018-02-06 Tue 00:50] =>  1:51
  CLOCK: [2018-02-04 Sun 22:10]--[2018-02-04 Sun 22:23] =>  0:13
  CLOCK: [2018-02-04 Sun 20:38]--[2018-02-04 Sun 22:00] =>  1:22
  :END:

* 3.2: More complex scraping in Python?
  :LOGBOOK:
  CLOCK: [2018-02-08 Thu 21:37]--[2018-02-08 Thu 21:41] =>  0:04
  CLOCK: [2018-02-08 Thu 20:18]--[2018-02-08 Thu 21:03] =>  0:45
  CLOCK: [2018-02-08 Thu 18:27]--[2018-02-08 Thu 19:08] =>  0:41
  CLOCK: [2018-02-06 Tue 22:04]--[2018-02-06 Tue 22:20] =>  0:16
  CLOCK: [2018-02-06 Tue 20:53]--[2018-02-06 Tue 21:22] =>  0:29
  CLOCK: [2018-02-06 Tue 18:34]--[2018-02-06 Tue 19:17] =>  0:43
  CLOCK: [2018-02-04 Sun 22:00]--[2018-02-04 Sun 22:10] =>  0:10
  :END:
  
* 4.1: R in the newsroom: the tidyverse
  :LOGBOOK:
  CLOCK: [2018-02-10 Sat 15:08]--[2018-02-10 Sat 22:49] =>  7:41
  :END:

